Revit 2018 API
VertexPosition Class
 A geometry vertex specified as a position in space.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public class VertexPosition : Vertex
Visual Basic
Public Class VertexPosition _
	Inherits Vertex
Visual C++
public ref class VertexPosition : public Vertex
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.Vertex
 Autodesk.Revit.DB.DirectContext3D.VertexPosition
See Also
VertexPosition Members
Autodesk.Revit.DB.DirectContext3D Namespace